MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX530F128H.atdf
         <module id="00800" name="CVR" version="">
            <instance name="CVR">
               <register-group address-space="periph0" name="CVR" name-in-module="CVR" offset="0x1f809800" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00735" name="DMAC" version="">
            <instance name="DMAC">
               <register-group address-space="periph2" name="DMAC" name-in-module="DMAC" offset="0x1f883000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00774" name="I2C" version="">
            <instance name="I2C1">
               <register-group address-space="periph0" name="I2C" name-in-module="I2C" offset="0x1f805000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="I2C2">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00740" name="ICAP" version="">
            <instance name="ICAP1">
               <register-group address-space="periph0" name="ICAP" name-in-module="ICAP" offset="0x1f802000" />
               <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 3"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 2"/>
               </parameters>
            </instance>
            <instance name="ICAP2">
               <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 3"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 2"/>
               </parameters>
            </instance>
            <instance name="ICAP3">
               <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 3"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 2"/>
               </parameters>
            </instance>
            <instance name="ICAP4">
               <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 3"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 2"/>
               </parameters>
            </instance>
            <instance name="ICAP5">
               <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 3"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 2"/>
               </parameters>
            </instance>
         </module>
         <module id="02495" name="INT" version="">
            <instance name="INT">
               <register-group address-space="periph2" name="INT" name-in-module="INT" offset="0x1f881000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="01390" name="NVM" version="">
            <instance name="NVM">
               <register-group address-space="periph1" name="NVM" name-in-module="NVM" offset="0x1f80f400" />
               <parameters>
                  <param name="PAGE_SIZE" value="1024"/>
                  <param name="ROW_SIZE" value="128"/>
               </parameters>
            </instance>
         </module>
         <module id="00749" name="OCMP" version="">
            <instance name="OCMP1">
               <register-group address-space="periph0" name="OCMP" name-in-module="OCMP" offset="0x1f803000" />
               <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
               </parameters>
            </instance>
            <instance name="OCMP2">
               <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
               </parameters>
            </instance>
            <instance name="OCMP3">
               <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
               </parameters>
            </instance>
            <instance name="OCMP4">
               <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
               </parameters>
            </instance>
            <instance name="OCMP5">
               <parameters>
                  <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
                  <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
               </parameters>
            </instance>
         </module>
         <module id="01416" name="OSC" version="">
            <instance name="OSC">
               <register-group address-space="periph1" name="OSC" name-in-module="OSC" offset="0x1f80f000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00751" name="PMP" version="">
            <instance name="PMP">
               <register-group address-space="periph0" name="PMP" name-in-module="PMP" offset="0x1f807000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02495" name="PORT" version="">
            <instance name="PORTB">
               <register-group address-space="periph2" name="PORT" name-in-module="PORT" offset="0x1f886100" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="PORTC">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="PORTD">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="PORTE">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="PORTF">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
