MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX530F128H.atdf
      <value-group caption="FIFO Selection bits" name="C1FLTCON6__FSEL26">
         <value caption="Message matching filter is stored in FIFO buffer 31" name="" value="0x1f" />
         <value caption="Message matching filter is stored in FIFO buffer 30" name="" value="0x1e" />
         <value caption="Message matching filter is stored in FIFO buffer 29" name="" value="0x1d" />
         <value caption="Message matching filter is stored in FIFO buffer 28" name="" value="0x1c" />
         <value caption="Message matching filter is stored in FIFO buffer 27" name="" value="0x1b" />
         <value caption="Message matching filter is stored in FIFO buffer 26" name="" value="0x1a" />
         <value caption="Message matching filter is stored in FIFO buffer 25" name="" value="0x19" />
         <value caption="Message matching filter is stored in FIFO buffer 24" name="" value="0x18" />
         <value caption="Message matching filter is stored in FIFO buffer 23" name="" value="0x17" />
         <value caption="Message matching filter is stored in FIFO buffer 22" name="" value="0x16" />
         <value caption="Message matching filter is stored in FIFO buffer 21" name="" value="0x15" />
         <value caption="Message matching filter is stored in FIFO buffer 20" name="" value="0x14" />
         <value caption="Message matching filter is stored in FIFO buffer 19" name="" value="0x13" />
         <value caption="Message matching filter is stored in FIFO buffer 18" name="" value="0x12" />
         <value caption="Message matching filter is stored in FIFO buffer 17" name="" value="0x11" />
         <value caption="Message matching filter is stored in FIFO buffer 16" name="" value="0x10" />
         <value caption="Message matching filter is stored in FIFO buffer 15" name="" value="0xf" />
         <value caption="Message matching filter is stored in FIFO buffer 14" name="" value="0xe" />
         <value caption="Message matching filter is stored in FIFO buffer 13" name="" value="0xd" />
         <value caption="Message matching filter is stored in FIFO buffer 12" name="" value="0xc" />
         <value caption="Message matching filter is stored in FIFO buffer 11" name="" value="0xb" />
         <value caption="Message matching filter is stored in FIFO buffer 10" name="" value="0xa" />
         <value caption="Message matching filter is stored in FIFO buffer 9" name="" value="0x9" />
         <value caption="Message matching filter is stored in FIFO buffer 8" name="" value="0x8" />
         <value caption="Message matching filter is stored in FIFO buffer 7" name="" value="0x7" />
         <value caption="Message matching filter is stored in FIFO buffer 6" name="" value="0x6" />
         <value caption="Message matching filter is stored in FIFO buffer 5" name="" value="0x5" />
         <value caption="Message matching filter is stored in FIFO buffer 4" name="" value="0x4" />
         <value caption="Message matching filter is stored in FIFO buffer 3" name="" value="0x3" />
         <value caption="Message matching filter is stored in FIFO buffer 2" name="" value="0x2" />
         <value caption="Message matching filter is stored in FIFO buffer 1" name="" value="0x1" />
         <value caption="Message matching filter is stored in FIFO buffer 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Filter 26 Mask Select bits" name="C1FLTCON6__MSEL26">
         <value caption="Acceptance Mask 3 selected" name="" value="0x3" />
         <value caption="Acceptance Mask 2 selected" name="" value="0x2" />
         <value caption="Acceptance Mask 1 selected" name="" value="0x1" />
         <value caption="Acceptance Mask 0 selected" name="" value="0x0" />
      </value-group>
      <value-group caption="Filter 26 Enable bit" name="C1FLTCON6__FLTEN26">
         <value caption="Filter is enabled" name="" value="0x1" />
         <value caption="Filter is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="FIFO Selection bits" name="C1FLTCON6__FSEL27">
         <value caption="Message matching filter is stored in FIFO buffer 31" name="" value="0x1f" />
         <value caption="Message matching filter is stored in FIFO buffer 30" name="" value="0x1e" />
         <value caption="Message matching filter is stored in FIFO buffer 29" name="" value="0x1d" />
         <value caption="Message matching filter is stored in FIFO buffer 28" name="" value="0x1c" />
         <value caption="Message matching filter is stored in FIFO buffer 27" name="" value="0x1b" />
         <value caption="Message matching filter is stored in FIFO buffer 26" name="" value="0x1a" />
         <value caption="Message matching filter is stored in FIFO buffer 25" name="" value="0x19" />
         <value caption="Message matching filter is stored in FIFO buffer 24" name="" value="0x18" />
         <value caption="Message matching filter is stored in FIFO buffer 23" name="" value="0x17" />
         <value caption="Message matching filter is stored in FIFO buffer 22" name="" value="0x16" />
         <value caption="Message matching filter is stored in FIFO buffer 21" name="" value="0x15" />
         <value caption="Message matching filter is stored in FIFO buffer 20" name="" value="0x14" />
         <value caption="Message matching filter is stored in FIFO buffer 19" name="" value="0x13" />
         <value caption="Message matching filter is stored in FIFO buffer 18" name="" value="0x12" />
         <value caption="Message matching filter is stored in FIFO buffer 17" name="" value="0x11" />
         <value caption="Message matching filter is stored in FIFO buffer 16" name="" value="0x10" />
         <value caption="Message matching filter is stored in FIFO buffer 15" name="" value="0xf" />
         <value caption="Message matching filter is stored in FIFO buffer 14" name="" value="0xe" />
         <value caption="Message matching filter is stored in FIFO buffer 13" name="" value="0xd" />
         <value caption="Message matching filter is stored in FIFO buffer 12" name="" value="0xc" />
         <value caption="Message matching filter is stored in FIFO buffer 11" name="" value="0xb" />
         <value caption="Message matching filter is stored in FIFO buffer 10" name="" value="0xa" />
         <value caption="Message matching filter is stored in FIFO buffer 9" name="" value="0x9" />
         <value caption="Message matching filter is stored in FIFO buffer 8" name="" value="0x8" />
         <value caption="Message matching filter is stored in FIFO buffer 7" name="" value="0x7" />
         <value caption="Message matching filter is stored in FIFO buffer 6" name="" value="0x6" />
         <value caption="Message matching filter is stored in FIFO buffer 5" name="" value="0x5" />
         <value caption="Message matching filter is stored in FIFO buffer 4" name="" value="0x4" />
         <value caption="Message matching filter is stored in FIFO buffer 3" name="" value="0x3" />
         <value caption="Message matching filter is stored in FIFO buffer 2" name="" value="0x2" />
         <value caption="Message matching filter is stored in FIFO buffer 1" name="" value="0x1" />
         <value caption="Message matching filter is stored in FIFO buffer 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Filter 27 Mask Select bits" name="C1FLTCON6__MSEL27">
         <value caption="Acceptance Mask 3 selected" name="" value="0x3" />
         <value caption="Acceptance Mask 2 selected" name="" value="0x2" />
         <value caption="Acceptance Mask 1 selected" name="" value="0x1" />
         <value caption="Acceptance Mask 0 selected" name="" value="0x0" />
      </value-group>
      <value-group caption="Filter 27 Enable bit" name="C1FLTCON6__FLTEN27">
         <value caption="Filter is enabled" name="" value="0x1" />
         <value caption="Filter is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="FIFO Selection bits" name="C1FLTCON7__FSEL28">
         <value caption="Message matching filter is stored in FIFO buffer 31" name="" value="0x1f" />
         <value caption="Message matching filter is stored in FIFO buffer 30" name="" value="0x1e" />
         <value caption="Message matching filter is stored in FIFO buffer 29" name="" value="0x1d" />
         <value caption="Message matching filter is stored in FIFO buffer 28" name="" value="0x1c" />
         <value caption="Message matching filter is stored in FIFO buffer 27" name="" value="0x1b" />
         <value caption="Message matching filter is stored in FIFO buffer 26" name="" value="0x1a" />
         <value caption="Message matching filter is stored in FIFO buffer 25" name="" value="0x19" />
         <value caption="Message matching filter is stored in FIFO buffer 24" name="" value="0x18" />
         <value caption="Message matching filter is stored in FIFO buffer 23" name="" value="0x17" />
         <value caption="Message matching filter is stored in FIFO buffer 22" name="" value="0x16" />
         <value caption="Message matching filter is stored in FIFO buffer 21" name="" value="0x15" />
         <value caption="Message matching filter is stored in FIFO buffer 20" name="" value="0x14" />
         <value caption="Message matching filter is stored in FIFO buffer 19" name="" value="0x13" />
         <value caption="Message matching filter is stored in FIFO buffer 18" name="" value="0x12" />
         <value caption="Message matching filter is stored in FIFO buffer 17" name="" value="0x11" />
         <value caption="Message matching filter is stored in FIFO buffer 16" name="" value="0x10" />
         <value caption="Message matching filter is stored in FIFO buffer 15" name="" value="0xf" />
         <value caption="Message matching filter is stored in FIFO buffer 14" name="" value="0xe" />
         <value caption="Message matching filter is stored in FIFO buffer 13" name="" value="0xd" />
         <value caption="Message matching filter is stored in FIFO buffer 12" name="" value="0xc" />
         <value caption="Message matching filter is stored in FIFO buffer 11" name="" value="0xb" />
         <value caption="Message matching filter is stored in FIFO buffer 10" name="" value="0xa" />
         <value caption="Message matching filter is stored in FIFO buffer 9" name="" value="0x9" />
         <value caption="Message matching filter is stored in FIFO buffer 8" name="" value="0x8" />
         <value caption="Message matching filter is stored in FIFO buffer 7" name="" value="0x7" />
         <value caption="Message matching filter is stored in FIFO buffer 6" name="" value="0x6" />
         <value caption="Message matching filter is stored in FIFO buffer 5" name="" value="0x5" />
         <value caption="Message matching filter is stored in FIFO buffer 4" name="" value="0x4" />
         <value caption="Message matching filter is stored in FIFO buffer 3" name="" value="0x3" />
         <value caption="Message matching filter is stored in FIFO buffer 2" name="" value="0x2" />
         <value caption="Message matching filter is stored in FIFO buffer 1" name="" value="0x1" />
         <value caption="Message matching filter is stored in FIFO buffer 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Filter 28 Mask Select bits" name="C1FLTCON7__MSEL28">
         <value caption="Acceptance Mask 3 selected" name="" value="0x3" />
         <value caption="Acceptance Mask 2 selected" name="" value="0x2" />
         <value caption="Acceptance Mask 1 selected" name="" value="0x1" />
         <value caption="Acceptance Mask 0 selected" name="" value="0x0" />
      </value-group>
