MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX530F128H.atdf
         <register caption="" name="CNSTATB" offset="0x90" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNSTATB" />
            <bitfield mask="0x00000002" name="CNSTATB" />
            <bitfield mask="0x00000004" name="CNSTATB" />
            <bitfield mask="0x00000008" name="CNSTATB" />
            <bitfield mask="0x00000010" name="CNSTATB" />
            <bitfield mask="0x00000020" name="CNSTATB" />
            <bitfield mask="0x00000040" name="CNSTATB" />
            <bitfield mask="0x00000080" name="CNSTATB" />
            <bitfield mask="0x00000100" name="CNSTATB" />
            <bitfield mask="0x00000200" name="CNSTATB" />
            <bitfield mask="0x00000400" name="CNSTATB" />
            <bitfield mask="0x00000800" name="CNSTATB" />
            <bitfield mask="0x00001000" name="CNSTATB" />
            <bitfield mask="0x00002000" name="CNSTATB" />
            <bitfield mask="0x00004000" name="CNSTATB" />
            <bitfield mask="0x00008000" name="CNSTATB" />
         </register>
         <register caption="" name="CNSTATC" offset="0x190" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNSTATC" />
            <bitfield mask="0x00000002" name="CNSTATC" />
            <bitfield mask="0x00000004" name="CNSTATC" />
            <bitfield mask="0x00000008" name="CNSTATC" />
            <bitfield mask="0x00000010" name="CNSTATC" />
            <bitfield mask="0x00000020" name="CNSTATC" />
            <bitfield mask="0x00000040" name="CNSTATC" />
            <bitfield mask="0x00000080" name="CNSTATC" />
            <bitfield mask="0x00000100" name="CNSTATC" />
            <bitfield mask="0x00000200" name="CNSTATC" />
            <bitfield mask="0x00000400" name="CNSTATC" />
            <bitfield mask="0x00000800" name="CNSTATC" />
            <bitfield mask="0x00001000" name="CNSTATC" />
            <bitfield mask="0x00002000" name="CNSTATC" />
            <bitfield mask="0x00004000" name="CNSTATC" />
            <bitfield mask="0x00008000" name="CNSTATC" />
         </register>
         <register caption="" name="CNSTATD" offset="0x290" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNSTATD" />
            <bitfield mask="0x00000002" name="CNSTATD" />
            <bitfield mask="0x00000004" name="CNSTATD" />
            <bitfield mask="0x00000008" name="CNSTATD" />
            <bitfield mask="0x00000010" name="CNSTATD" />
            <bitfield mask="0x00000020" name="CNSTATD" />
            <bitfield mask="0x00000040" name="CNSTATD" />
            <bitfield mask="0x00000080" name="CNSTATD" />
            <bitfield mask="0x00000100" name="CNSTATD" />
            <bitfield mask="0x00000200" name="CNSTATD" />
            <bitfield mask="0x00000400" name="CNSTATD" />
            <bitfield mask="0x00000800" name="CNSTATD" />
            <bitfield mask="0x00001000" name="CNSTATD" />
            <bitfield mask="0x00002000" name="CNSTATD" />
            <bitfield mask="0x00004000" name="CNSTATD" />
            <bitfield mask="0x00008000" name="CNSTATD" />
         </register>
         <register caption="" name="CNSTATE" offset="0x390" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNSTATE" />
            <bitfield mask="0x00000002" name="CNSTATE" />
            <bitfield mask="0x00000004" name="CNSTATE" />
            <bitfield mask="0x00000008" name="CNSTATE" />
            <bitfield mask="0x00000010" name="CNSTATE" />
            <bitfield mask="0x00000020" name="CNSTATE" />
            <bitfield mask="0x00000040" name="CNSTATE" />
            <bitfield mask="0x00000080" name="CNSTATE" />
            <bitfield mask="0x00000100" name="CNSTATE" />
            <bitfield mask="0x00000200" name="CNSTATE" />
            <bitfield mask="0x00000400" name="CNSTATE" />
            <bitfield mask="0x00000800" name="CNSTATE" />
            <bitfield mask="0x00001000" name="CNSTATE" />
            <bitfield mask="0x00002000" name="CNSTATE" />
            <bitfield mask="0x00004000" name="CNSTATE" />
            <bitfield mask="0x00008000" name="CNSTATE" />
         </register>
         <register caption="" name="CNSTATF" offset="0x490" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNSTATF" />
            <bitfield mask="0x00000002" name="CNSTATF" />
            <bitfield mask="0x00000004" name="CNSTATF" />
            <bitfield mask="0x00000008" name="CNSTATF" />
            <bitfield mask="0x00000010" name="CNSTATF" />
            <bitfield mask="0x00000020" name="CNSTATF" />
            <bitfield mask="0x00000040" name="CNSTATF" />
            <bitfield mask="0x00000080" name="CNSTATF" />
            <bitfield mask="0x00000100" name="CNSTATF" />
            <bitfield mask="0x00000200" name="CNSTATF" />
            <bitfield mask="0x00000400" name="CNSTATF" />
            <bitfield mask="0x00000800" name="CNSTATF" />
            <bitfield mask="0x00001000" name="CNSTATF" />
            <bitfield mask="0x00002000" name="CNSTATF" />
            <bitfield mask="0x00004000" name="CNSTATF" />
            <bitfield mask="0x00008000" name="CNSTATF" />
         </register>
         <register caption="" name="CNSTATG" offset="0x590" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CNSTATG" />
            <bitfield mask="0x00000002" name="CNSTATG" />
            <bitfield mask="0x00000004" name="CNSTATG" />
            <bitfield mask="0x00000008" name="CNSTATG" />
            <bitfield mask="0x00000010" name="CNSTATG" />
            <bitfield mask="0x00000020" name="CNSTATG" />
            <bitfield mask="0x00000040" name="CNSTATG" />
            <bitfield mask="0x00000080" name="CNSTATG" />
            <bitfield mask="0x00000100" name="CNSTATG" />
            <bitfield mask="0x00000200" name="CNSTATG" />
            <bitfield mask="0x00000400" name="CNSTATG" />
            <bitfield mask="0x00000800" name="CNSTATG" />
            <bitfield mask="0x00001000" name="CNSTATG" />
            <bitfield mask="0x00002000" name="CNSTATG" />
            <bitfield mask="0x00004000" name="CNSTATG" />
            <bitfield mask="0x00008000" name="CNSTATG" />
         </register>
      </register-group>
   </module>
   <module caption="" id="02028" name="RCON" version="4">
      <register-group name="RCON">
         <register caption="Reset Control Register" name="RCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Power-on Reset Flag bit" mask="0x00000001" name="POR" values="RCON__POR" />
            <bitfield caption="Brown-out Reset Flag bit" mask="0x00000002" name="BOR" values="RCON__BOR" />
            <bitfield caption="Wake From Idle Flag bit" mask="0x00000004" name="IDLE" values="RCON__IDLE" />
            <bitfield caption="Wake From Sleep Flag bit" mask="0x00000008" name="SLEEP" values="RCON__SLEEP" />
            <bitfield caption="Watchdog Timer Time-out Flag bit" mask="0x00000010" name="WDTO" values="RCON__WDTO" />
            <bitfield caption="Software Reset Flag bit" mask="0x00000040" name="SWR" values="RCON__SWR" />
            <bitfield caption="External Reset Pin Flag bit" mask="0x00000080" name="EXTR" values="RCON__EXTR" />
            <bitfield caption="Voltage Regulator Standby Enable bit" mask="0x00000100" name="VREGS" values="RCON__VREGS" />
            <bitfield caption="Configuration Mismatch Reset Flag bit" mask="0x00000200" name="CMR" values="RCON__CMR" />
            <bitfield caption="High Voltage Detect Reset Flag bit" mask="0x20000000" name="HVDR" values="RCON__HVDR" />
         </register>
         <register caption="Software Reset Register" name="RSWRST" offset="0x10" rw="RW" size="4">
            <bitfield caption="Software Reset Trigger bit" mask="0x00000001" name="SWRST" values="RSWRST__SWRST" />
         </register>
      </register-group>
