MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX530F128H.atdf
         <register caption="" name="RPG7R" offset="0x19c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPG7R" />
         </register>
         <register caption="" name="RPG8R" offset="0x1a0" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPG8R" />
         </register>
         <register caption="" name="RPG9R" offset="0x1a4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPG9R" />
         </register>
         <register caption="" name="RPG10R" offset="0x1a8" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPG10R" />
         </register>
         <register caption="" name="RPG11R" offset="0x1ac" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPG11R" />
         </register>
         <register caption="" name="RPG12R" offset="0x1b0" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPG12R" />
         </register>
         <register caption="" name="RPG13R" offset="0x1b4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPG13R" />
         </register>
         <register caption="" name="RPG14R" offset="0x1b8" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPG14R" />
         </register>
         <register caption="" name="RPG15R" offset="0x1bc" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPG15R" />
         </register>
      </register-group>
   </module>
   <module caption="" id="00748" name="RTCC" version="1">
      <register-group name="RTCC">
         <register caption="RTC Control Register" name="RTCCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="RTCC Output Enable bit" mask="0x00000001" name="RTCOE" values="RTCCON__RTCOE" />
            <bitfield caption="Half-Second Status bit" mask="0x00000002" name="HALFSEC" values="RTCCON__HALFSEC" />
            <bitfield caption="RTCC Value Registers Read Synchronization bit" mask="0x00000004" name="RTCSYNC" values="RTCCON__RTCSYNC" />
            <bitfield caption="RTC Value Registers Write Enable bit" mask="0x00000008" name="RTCWREN" values="RTCCON__RTCWREN" />
            <bitfield caption="RTCC Clock Enable Status bit" mask="0x00000040" name="RTCCLKON" values="RTCCON__RTCCLKON" />
            <bitfield caption="RTCC Seconds Clock Output Select bit" mask="0x00000080" name="RTSECSEL" values="RTCCON__RTSECSEL" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="RTCCON__SIDL" />
            <bitfield caption="RTCC On bit" mask="0x00008000" name="ON" values="RTCCON__ON" />
            <bitfield caption="RTC Drift Calibration bits" mask="0x03FF0000" name="CAL" values="RTCCON__CAL" />
         </register>
         <register caption="RTC ALARM Control Register" name="RTCALRM" offset="0x10" rw="RW" size="4">
            <bitfield caption="Alarm Repeat Counter Value bits" mask="0x000000FF" name="ARPT" values="RTCALRM__ARPT" />
            <bitfield caption="Alarm Mask Configuration bits" mask="0x00000F00" name="AMASK" values="RTCALRM__AMASK" />
            <bitfield caption="Alarm Sync bit" mask="0x00001000" name="ALRMSYNC" values="RTCALRM__ALRMSYNC" />
            <bitfield caption="Alarm Pulse Initial Value bit" mask="0x00002000" name="PIV" values="RTCALRM__PIV" />
            <bitfield caption="Chime Enable bit" mask="0x00004000" name="CHIME" values="RTCALRM__CHIME" />
            <bitfield caption="Alarm Enable bit" mask="0x00008000" name="ALRMEN" values="RTCALRM__ALRMEN" />
         </register>
         <register caption="RTC Time Value Register" name="RTCTIME" offset="0x20" rw="RW" size="4">
            <bitfield mask="0x00000F00" name="SEC01" />
            <bitfield mask="0x0000F000" name="SEC10" />
            <bitfield mask="0x000F0000" name="MIN01" />
            <bitfield mask="0x00F00000" name="MIN10" />
            <bitfield mask="0x0F000000" name="HR01" />
            <bitfield mask="0xF0000000" name="HR10" />
         </register>
         <register caption="RTC Date Value Register" name="RTCDATE" offset="0x30" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="WDAY01" />
            <bitfield mask="0x00000F00" name="DAY01" />
            <bitfield mask="0x0000F000" name="DAY10" />
            <bitfield mask="0x000F0000" name="MONTH01" />
            <bitfield mask="0x00F00000" name="MONTH10" />
            <bitfield mask="0x0F000000" name="YEAR01" />
            <bitfield mask="0xF0000000" name="YEAR10" />
         </register>
         <register caption="Alarm Time Value Register" name="ALRMTIME" offset="0x40" rw="RW" size="4">
            <bitfield mask="0x00000F00" name="SEC01" />
            <bitfield mask="0x0000F000" name="SEC10" />
            <bitfield mask="0x000F0000" name="MIN01" />
            <bitfield mask="0x00F00000" name="MIN10" />
            <bitfield mask="0x0F000000" name="HR01" />
            <bitfield mask="0xF0000000" name="HR10" />
         </register>
         <register caption="Alarm Date Value Register" name="ALRMDATE" offset="0x50" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="WDAY01" />
            <bitfield mask="0x00000F00" name="DAY01" />
            <bitfield mask="0x0000F000" name="DAY10" />
            <bitfield mask="0x000F0000" name="MONTH01" />
            <bitfield mask="0x00F00000" name="MONTH10" />
         </register>
      </register-group>
      <value-group caption="RTCC Output Enable bit" name="RTCCON__RTCOE">
         <value caption="RTCC clock output is enabled clock presented onto an I/O" name="" value="0x1" />
         <value caption="RTCC clock output is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Half-Second Status bit" name="RTCCON__HALFSEC">
         <value caption="Second half period of a second" name="" value="0x1" />
         <value caption="First half period of a second" name="" value="0x0" />
      </value-group>
      <value-group caption="RTCC Value Registers Read Synchronization bit" name="RTCCON__RTCSYNC">
         <value caption="RTC Value registers can change while reading due to a rollover ripple that results in an invalid data read" name="" value="0x1" />
         <value caption="RTC Value registers can be read without concern about a rollover ripple" name="" value="0x0" />
      </value-group>
      <value-group caption="RTC Value Registers Write Enable bit" name="RTCCON__RTCWREN">
         <value caption="RTC Value registers can be written to by the user" name="" value="0x1" />
         <value caption="RTC Value registers are locked out from being written to by the user" name="" value="0x0" />
      </value-group>
