MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX530F128H.atdf
      <value-group caption="Endpoint Receive Enable bit" name="U1EP14__EPRXEN">
         <value caption="Endpoint n receive is enabled" name="" value="0x1" />
         <value caption="Endpoint n receive is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Bidirectional Endpoint Control bit" name="U1EP14__EPCONDIS">
         <value caption="Disable Endpoint n from Control transfers; only TX and RX transfers allowed" name="" value="0x1" />
         <value caption="Enable Endpoint n for Control (SETUP) transfers; TX and RX transfers also allowed" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Handshake Enable bit" name="U1EP15__EPHSHK">
         <value caption="Endpoint Handshake is enabled" name="" value="0x1" />
         <value caption="Endpoint Handshake is disabled (typically used for isochronous endpoints)" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Stall Status bit" name="U1EP15__EPSTALL">
         <value caption="Endpoint n was stalled" name="" value="0x1" />
         <value caption="Endpoint n was not stalled" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Transmit Enable bit" name="U1EP15__EPTXEN">
         <value caption="Endpoint n transmit is enabled" name="" value="0x1" />
         <value caption="Endpoint n transmit is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Endpoint Receive Enable bit" name="U1EP15__EPRXEN">
         <value caption="Endpoint n receive is enabled" name="" value="0x1" />
         <value caption="Endpoint n receive is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Bidirectional Endpoint Control bit" name="U1EP15__EPCONDIS">
         <value caption="Disable Endpoint n from Control transfers; only TX and RX transfers allowed" name="" value="0x1" />
         <value caption="Enable Endpoint n for Control (SETUP) transfers; TX and RX transfers also allowed" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="01385" name="WDT" version="2">
      <register-group name="WDT">
         <register caption="Watchdog Timer Control Register" name="WDTCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Watchdog Timer Reset bit" mask="0x00000001" name="WDTCLR" values="WDTCON__WDTCLR" />
            <bitfield caption="Watchdog Timer Window Enable bit" mask="0x00000002" name="WDTWINEN" values="WDTCON__WDTWINEN" />
            <bitfield mask="0x0000007C" name="SWDTPS" />
            <bitfield caption="Watchdog Timer Enable bit" mask="0x00008000" name="ON" values="WDTCON__ON" />
         </register>
      </register-group>
      <value-group caption="Watchdog Timer Reset bit" name="WDTCON__WDTCLR">
         <value caption="Writing a 1 will clear the WDT" name="" value="0x1" />
         <value caption="Software cannot force this bit to a 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Watchdog Timer Window Enable bit" name="WDTCON__WDTWINEN">
         <value caption="Enable windowed Watchdog Timer" name="" value="0x1" />
         <value caption="Disable windowed Watchdog Timer" name="" value="0x0" />
      </value-group>
      <value-group caption="Watchdog Timer Enable bit" name="WDTCON__ON">
         <value caption="Enables the WDT if it is not enabled by the device configuration" name="" value="0x1" />
         <value caption="Disable the WDT if it was enabled in software" name="" value="0x0" />
      </value-group>
   </module>
</modules>
<pinouts/>
</avr-tools-device-file>

